Revit 2027 API
CylindricalHelix.Height Property
 Height of the cylindrical helix.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
public:
property double Height {
	double get ();
}
member Height : float with get
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  Height is not defined for unbounded helix.
Remarks
 It is the length of the span of the helix along the axis direction. The height is defined only if the helix is bounded. That is, its start and end angles (parameters) are specified.
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace